In [1]:
import pandas as pd
import pymysql
import requests

In [2]:
transactions_df = pd.read_csv('transactions.csv')
products_df = pd.read_excel('products.xlsx')

# 1. Membuat Koneksi Database

In [3]:
# Membuat koneksi ke database MySQL
conn = pymysql.connect(host='127.0.0.1', port = 3306, user='root', password='dzikri123', database='customers')

# Mengambil data pelanggan menggunakan pymysql
customers_df = pd.read_sql_query("SELECT * FROM customers", conn)

# Menampilkan informasi singkat tentang DataFrame
print("\nInformasi Pelanggan:")
print(customers_df.info())

# Menutup koneksi
conn.close()

Informasi Pelanggan:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ID       20 non-null     int64
 1   name     20 non-null     object
 2   email    20 non-null     object
 3   address  20 non-null     object
dtypes: int64(1), object(3)
memory usage: 768.0+ bytes
None

C:\Users\dzikri\AppData\Local\Temp\ipykernel_30116\2592322857.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  customers_df = pd.read_sql_query("SELECT * FROM customers", conn)

# 2. Mengirim Response

In [4]:
api_url = 'https://fakestoreapi.com/products'

# Mengambil data pengiriman dari API
response = requests.get(api_url)

# Mengonversi respons menjadi format JSON
shipping_data = response.json()

# Membuat DataFrame dari data pengiriman
shipping_df = pd.DataFrame(shipping_data)

# 3. Membuat Dataframes

In [5]:
dataframes = {
    'transactions': transactions_df,
    'products': products_df,
    'customers': customers_df,
    'shipping': shipping_df
}

# Simpan semua data ke dalam file Parquet
for name, df in dataframes.items():
    df.to_parquet(f'{name}.parquet')

In [6]:
products_df.info()
transactions_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            100 non-null    int64
 1   Product Name  100 non-null    object
 2   Category      100 non-null    object
 3   Description   100 non-null    object
 4   Price         100 non-null    float64
dtypes: float64(1), int64(1), object(3)
memory usage: 4.0+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Transaction ID  100 non-null    int64
 1   User ID         100 non-null    int64
 2   Item Name       100 non-null    object
 3   Quantity        100 non-null    int64
 4   Value (USD)     100 non-null    float64
 5   Status          100 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 4.8+ KB

In [7]:
customers_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ID       20 non-null     int64
 1   name     20 non-null     object
 2   email    20 non-null     object
 3   address  20 non-null     object
dtypes: int64(1), object(3)
memory usage: 768.0+ bytes

In [8]:
customers_df.head()

,ID,name,email,address
0,1,John Doe,john.doe@example.com,"123 Main St, City, Country"
1,2,Jane Smith,jane.smith@example.com,"456 Elm St, City, Country"
2,3,Michael Johnson,michael.johnson@example.com,"789 Oak St, City, Country"
3,4,Emily Brown,emily.brown@example.com,"101 Pine St, City, Country"
4,5,William Taylor,william.taylor@example.com,"202 Maple St, City, Country"

In [9]:
customers_df.tail()

    ID          name                     email                        address
15  16  Evelyn Evans  evelyn.evans@example.com  1313 Walnut St, City, Country
16  17     Owen Hall     owen.hall@example.com  1414 Cherry St, City, Country
17  18    Liam Green    liam.green@example.com     1515 Oak St, City, Country
18  19    Avery Hill    avery.hill@example.com    1616 Pine St, City, Country
19  20   Lucas Baker   lucas.baker@example.com     1717 Elm St, City, Country

In [10]:
products_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            100 non-null    int64
 1   Product Name  100 non-null    object
 2   Category      100 non-null    object
 3   Description   100 non-null    object
 4   Price         100 non-null    float64
dtypes: float64(1), int64(1), object(3)
memory usage: 4.0+ KB

In [11]:
products_df.head()

,ID,Product Name,Category,Description,Price
0,1,Laptop,Electronics,A powerful laptop with high performance and lo...,999.99
1,2,Smartphone,Electronics,A sleek smartphone with advanced features and ...,799.99
2,3,Headphones,Electronics,High-quality headphones with noise-canceling t...,199.99
3,4,Smartwatch,Electronics,A smartwatch with fitness tracking,299.99
4,5,Bluetooth Speaker,Electronics,A portable Bluetooth speaker with deep bass an...,79.99

In [12]:
products_df.tail()

,ID,Product Name,Category,Description,Price
95,96,Baby Musical Toy,Baby & Kids,A musical toy for entertaining and stimulating...,12.99
96,97,Baby Floor Mirror,Baby & Kids,A large floor mirror for baby's self-discovery...,19.99
97,98,Baby Mobile,Baby & Kids,A colorful baby mobile with rotating character...,29.99
98,99,Baby Stroller Organizer,Baby & Kids,A stroller organizer with multiple pockets for...,19.99
99,100,Baby Sun Hat,Baby & Kids,A wide-brimmed sun hat for protecting baby's d...,9.99

In [13]:
transactions_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Transaction ID  100 non-null    int64
 1   User ID         100 non-null    int64
 2   Item Name       100 non-null    object
 3   Quantity        100 non-null    int64
 4   Value (USD)     100 non-null    float64
 5   Status          100 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 4.8+ KB

In [14]:
transactions_df.head()

   Transaction ID  User ID          Item Name  Quantity  Value (USD)   Status
0               1     1001         Smartphone         1       799.99  success
1               2     1002         Headphones         2       399.98  success
2               3     1003             Laptop         1       999.99  success
3               4     1004  Bluetooth Speaker         1        79.99  success
4               5     1005         Smartwatch         1       299.99  pending

In [15]:
transactions_df.tail()

,Transaction ID,User ID,Item Name,Quantity,Value (USD),Status
95,96,1096,Baby Musical Toy,1,12.99,success
96,97,1097,Baby Floor Mirror,1,19.99,failed
97,98,1098,Baby Mobile,1,29.99,success
98,99,1099,Baby Stroller Organizer,1,19.99,success
99,100,1100,Baby Sun Hat,1,9.99,failed